Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
#include "stm32f4xx_hal.h"
#include "pin_config.h"
#include <math.h>
#include <string.h>
#include "crc8.h"
#include "pi_link.h"
#include "pi_transport.h"
#include "bmi088.h"
#include "ddsm315.h"
#include "st3215.h"
#include "mahony.h"
#include "kinematics.h"
#include "balance_trace.h"
#include "safety_state.h"
#include "servo_mapping.h"
#include "startup_manager.h"
#include "firmware_runtime.h"
#include "control_section.h"
#include "dma_rx_ring.h"

/* Peripheral Handles */
I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart1; /* CH340 Debug/Program */
UART_HandleTypeDef huart2; /* DDSM RS485 */
UART_HandleTypeDef huart3; /* ST3215 Half-Duplex Servo */
UART_HandleTypeDef huart6; /* Pi 5 Bridge */
IWDG_HandleTypeDef hiwdg;
DMA_HandleTypeDef hdma_usart6_rx;
DMA_HandleTypeDef hdma_usart3_rx;

/* ST3215 servo bus RX ring: 1 Mbaud is far beyond single-byte HAL IRQ
 * servicing; a circular DMA plus main-loop consumption removes the overrun
 * storm entirely (see st3215.c note).  The DmaRxRing wrapper reconstructs an
 * absolute producer cursor from NDTR so a main-loop stall that lets the DMA
 * lap the ring is counted in overrun_count instead of silently corrupting
 * in-flight frames. */
#define ST3215_RX_BUF_SIZE 64U
static uint8_t g_st3215_rx_buf[ST3215_RX_BUF_SIZE];
static DmaRxRing_t g_st3215_ring;

/* Real-Time Telemetry and State variables */
volatile uint32_t g_system_ticks = 0;
BMI088_t g_imu;
MahonyFilter_t g_mahony;

/* One-pole low-pass on pitch rate to suppress gyro noise amplified by K3.
 * α = 0.2 at 1 kHz → τ ≈ 4.5 ms → fc ≈ 35 Hz, well above balance bandwidth. */
static float g_pitch_rate_filt = 0.0f;
#define PITCH_RATE_FILTER_ALPHA 0.2f

/* Latest fused attitude, shared between the DRDY-driven fusion block and the
 * ms-deadline-driven safety block (which must keep running even if DRDY stops). */
static float g_body_pitch = 0.0f;
static float g_body_pitch_rate = 0.0f;

DDSM_State_t g_ddsm_left;
DDSM_State_t g_ddsm_right;
ST3215_State_t g_servos[4];
StartupManager_t g_startup_manager;
uint8_t g_actuator_discovery_step;
uint8_t g_actuator_configured;
/* Per-wheel mask (bit0=left, bit1=right) recording that a current-loop mode
 * frame has been (re)sent while the motor is enabled.  Mode switching while
 * the motor is disabled is unreliable on the DDSM315, so once the wheels are
 * armed we re-assert current mode on each wheel exactly once. */
static uint8_t g_wheel_mode_sent = 0U;
static DDSM_Bus_t g_ddsm_bus;
static ST3215_Bus_t g_st3215_bus;

/* Wheel torque commands computed and sent together at each 250 Hz deadline. */
static float g_ctrl_tau_l = 0.0f;
static float g_ctrl_tau_r = 0.0f;
static volatile float g_body_gyro[3] = {0.0f, 0.0f, 0.0f};

/* Final wheel-output authorization.  Updated once per 250 Hz control
 * deadline as the conjunction of three independent verdicts:
 *   - firmware_runtime intent (mode operational + startup authorized),
 *   - the actuator supervisor (verified enables, fresh leg support, safe
 *     posture — see actuator_supervisor.c),
 *   - current-loop mode re-assertion completed on both wheels.
 * Held between deadlines so every later consumer in the same control period
 * (LQR computation, bus dispatch) sees the same verdict; defaults to closed
 * until the first deadline opens it.  SWD-visible for bring-up forensics. */
static uint8_t g_wheel_output_gate = 0U;

/* The 250 Hz control section (safety -> supervisor verdict -> gate -> LQR ->
 * trace).  Extracted into control_section.c so the composition that
 * authorises wheel torque is host-testable; the scheduler samples inputs and
 * applies outputs.  SWD-visible for bring-up forensics. */
static ControlSection_t g_control_section;

/* Body-frame torque actually accepted by the DDSM queue at dispatch time and
 * the ms it was queued; the balance trace reports these as "sent" (distinct
 * from the LQR target) with an age-based validity bit. */
static float g_sent_tau_l = 0.0f;
static float g_sent_tau_r = 0.0f;
static uint32_t g_sent_tau_ms = 0U;

/* Set by the fusion block: attitude/rate are trustworthy for control only
 * after a FULL update or a bounded GYRO_ONLY window (see mahony.c). */
static uint8_t g_imu_control_valid = 0U;

/* ms of the last successfully queued STAND/ACTIVE leg-hold sync-write; the
 * supervisor's "leg target transmitted" input must reflect a real position
 * command on the wire, not merely a torque-enable frame. */
static uint32_t g_leg_hold_tx_ms = 0U;
#define LEG_HOLD_MAX_AGE_MS 100U

/* Max consecutive servo failures before a fatal FAULT lockdown */
#define SERVO_FAIL_LIMIT         3

/* DMA Buffer for Pi Bridge (USART6 RX) */
#define PI_RX_BUF_SIZE           256
uint8_t g_pi_rx_buf[PI_RX_BUF_SIZE];
static PiTransport_t g_pi_transport;
static volatile uint8_t g_pi_poll_requested = 0U;
static uint8_t g_reset_cause = 0U;

/* Main-loop stall forensics: the IMU data-ready handler (EXTI1, 1 kHz,
 * highest priority) watches the loop heartbeat; on a >100 ms stall it
 * snapshots UART status/error evidence to the RAM-top dump area so an
 * interrupt storm starving the loop is visible after the IWDG reset. */
volatile uint32_t g_loop_heartbeat_ms = 0U;
volatile uint32_t g_uart2_err_cnt = 0U;
volatile uint32_t g_uart3_err_cnt = 0U;
volatile uint32_t g_uart6_err_cnt = 0U;
volatile uint32_t g_uart2_rx_cnt = 0U;
volatile uint32_t g_uart3_rx_cnt = 0U;
/* Set by the UART error ISR when an RX error (ORE/NE/FE) fires: the HAL clears
 * CR3.DMAR and aborts the circular RX DMA on overrun, so without a re-arm the
 * bus stays deaf until reboot (observed on USART3: one boot-time ORE killed
 * all servo feedback).  The main loop performs the actual re-arm because the
 * DMA abort completes asynchronously (Receive_DMA returns BUSY inside the ISR). */
volatile uint8_t g_uart3_rx_rearm = 0U;
volatile uint8_t g_uart6_rx_rearm = 0U;

#define STALL_DUMP_BASE  0x2001FFC0U  /* 12 words; ends just below FAULT_DUMP @0x2001FFF0 */
#define STALL_DUMP_MAGIC 0x57A11EDU

void main_loop_stall_check(void) {
    volatile uint32_t *dump = (volatile uint32_t *)STALL_DUMP_BASE;
    uint32_t now = HAL_GetTick();
    if (dump[0] == STALL_DUMP_MAGIC) return;             /* keep first stall */
    if ((uint32_t)(now - g_loop_heartbeat_ms) <= 100U) return;
    dump[1] = g_loop_heartbeat_ms;
    dump[2] = g_system_ticks;
    dump[3] = huart2.Instance->SR;
    dump[4] = huart3.Instance->SR;
    dump[5] = huart6.Instance->SR;
    dump[6] = g_uart2_err_cnt;
    dump[7] = g_uart3_err_cnt;
    dump[8] = g_uart6_err_cnt;
    dump[9] = g_uart2_rx_cnt;
    dump[10] = g_uart3_rx_cnt;
    dump[11] = hdma_usart6_rx.Instance->NDTR;
    dump[0] = STALL_DUMP_MAGIC;
}

/* Function Prototypes */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_DMA_Init(void);
static void MX_IWDG_Init(void);
static void Pi_Command_Snapshot(Pi_Command_Heartbeat_t *hb, Pi_Command_Action_t *act);
static void Actuator_Feedback_Snapshot(DDSM_State_t *left,
                                       DDSM_State_t *right,
                                       ST3215_State_t servos[4]);
static uint8_t Read_Reset_Cause(void);
static uint16_t Device_Age_Ms(const DeviceHealth_t *health, uint32_t now_ms);
static uint16_t Device_Error_Count(const DeviceHealth_t *health);
static uint16_t Device_Timeout_Count(const DeviceHealth_t *health);
static uint16_t Device_Checksum_Count(const DeviceHealth_t *health);
static uint16_t Device_Protocol_Count(const DeviceHealth_t *health);
void Error_Handler(void);

int main(void) {
    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();
    g_reset_cause = Read_Reset_Cause();

    /* Configure the system clock to 168 MHz */
    SystemClock_Config();

