Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
    /* Keep the HAL tick alive under UART interrupt storms: HAL timeouts and
     * delay loops depend on it, and a starved tick turns a bounded 2 ms I2C
     * timeout into an unbounded wait. */
    NVIC_SetPriority(SysTick_IRQn, 0U);

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_I2C1_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_USART6_UART_Init();
    MX_IWDG_Init();

    /* Initialize drivers, CRC tables and control states */
    crc8_init();
    pi_link_init();
    pi_transport_init(&g_pi_transport, g_pi_rx_buf, PI_RX_BUF_SIZE);
    dma_rx_ring_init(&g_st3215_ring, g_st3215_rx_buf, ST3215_RX_BUF_SIZE);
    safety_state_init();
    control_section_init(&g_control_section, HAL_GetTick());
    balance_trace_init();
    balance_trace_set_metadata("kuafu-stm32", KUAFU_MODEL_HASH);
    mahony_init(&g_mahony, 10.0f, 0.002f); /* Kp high for fast balance tracking */

    g_ddsm_left.id = DDSM_LEFT_ID;
    g_ddsm_right.id = DDSM_RIGHT_ID;
    device_health_init(&g_ddsm_left.health);
    device_health_init(&g_ddsm_right.health);
#if DDSM_ID_CALIBRATION_TARGET > 0
    {
        uint8_t id_packet[DDSM_FRAME_SIZE];
        uint8_t repeat;
        ddsm_build_set_id(id_packet, DDSM_ID_CALIBRATION_TARGET);
        safety_state_trigger_fault(FAULT_WHEEL_LEFT | FAULT_WHEEL_RIGHT);
        HAL_Delay(250U);
        for (repeat = 0U; repeat < 5U; ++repeat) {
            (void)HAL_UART_Transmit(&huart2, id_packet, DDSM_FRAME_SIZE, 20U);
            HAL_Delay(4U);
        }
    }
#endif
    ddsm_bus_init(&g_ddsm_bus, &huart2);
    for (int i = 0; i < 4; i++) {
        g_servos[i].id = i + 1; /* IDs: 1, 2, 3, 4 */
        device_health_init(&g_servos[i].health);
        g_servos[i].health.online = 1U; /* optimistic discovery; first valid read timestamps it */
    }
    st3215_bus_init(&g_st3215_bus, &huart3);

    /* Start Pi Link bridge USART6 reception via DMA */
    __HAL_UART_ENABLE_IT(&huart6, UART_IT_IDLE);
    HAL_UART_Receive_DMA(&huart6, g_pi_rx_buf, PI_RX_BUF_SIZE);

    /* Arm gyro data-ready before starting the non-blocking device sequence. */
    HAL_NVIC_SetPriority(IMU_INT_EXTI_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(IMU_INT_EXTI_IRQn);

#if SERVO_ZERO_CALIBRATION_MODE
    /* A calibration image must never leave INIT and start commanding the
     * placeholder center ticks. FAULT keeps wheel commands at zero while the
     * background servo feedback poll remains active. */
    safety_state_trigger_fault(FAULT_SERVO);
#endif

    uint32_t last_tick = 0;
    uint32_t next_wheel_tx_ms = 0U;
    uint8_t next_wheel_is_right = 0U;
    uint8_t active_servo_query_idx = 0;
    uint32_t last_servo_query_ms = 0U;
    uint8_t fault_servo_disable_idx = 0U;
    uint32_t temp_refresh_counter = 0;
    uint8_t health_telemetry_divider = 0U;
    uint8_t bmi_init_in_progress = 0U;
    uint8_t servo_enable_step = 0U;
    uint8_t servos_enabled = 0U;
    uint8_t wheel_enable_mask = 0U;
    uint32_t next_actuator_enable_ms = 0U;
    uint32_t last_pi_poll_ms = 0U;
    FirmwareRuntime_t firmware_runtime;
    uint8_t servo_deadline_pending = 0U;

    startup_manager_init(&g_startup_manager, HAL_GetTick());
    firmware_runtime_init(&firmware_runtime, HAL_GetTick());

    /* Main background scheduler loop */
    while (1) {
        uint32_t startup_now = HAL_GetTick();
        g_loop_heartbeat_ms = startup_now;
        StartupInputs_t startup_inputs;
        StartupOutputs_t startup_outputs;
        FirmwareRuntimeInputs_t runtime_inputs;
        FirmwareRuntimeOutputs_t runtime_outputs;
        DDSM_State_t left_feedback;
        DDSM_State_t right_feedback;
        ST3215_State_t servo_feedback[4];
        uint8_t wheel_authorized;
        uint8_t startup_servos_online = 1U;

        if (g_uart6_rx_rearm) {
            /* Synchronous abort first: HAL clears CR3.DMAR and disables the RX
             * DMA on an ORE/NE/FE, and that teardown completes ASYNCHRONOUSLY.
             * Re-arming without waiting lets the late abort completion wipe the
             * fresh Receive_DMA state (observed on USART3: bus permanently deaf
             * with ORE latched, EIE=0 and no further error callbacks). */
            (void)HAL_UART_AbortReceive(&huart6);
            __HAL_UART_CLEAR_OREFLAG(&huart6);
            if (HAL_UART_Receive_DMA(&huart6, g_pi_rx_buf, PI_RX_BUF_SIZE) == HAL_OK) {
                /* The restarted stream begins at the ring base; the transport
                 * must not re-parse pre-restart content as new data. */
                pi_transport_reset(&g_pi_transport);
                g_uart6_rx_rearm = 0U;
            }
        } else if ((hdma_usart6_rx.Instance->CR & DMA_SxCR_EN) == 0U) {
            /* Deaf-DMA watchdog: the abort-after-rearm race can end with the
             * stream disabled and no error callback left to fire (EIE cleared),
             * so re-detection must not rely on the error path alone. */
            g_uart6_rx_rearm = 1U;
        }
        if (g_uart3_rx_rearm) {
            (void)HAL_UART_AbortReceive(&huart3);
            __HAL_UART_CLEAR_OREFLAG(&huart3);
            if (HAL_UART_Receive_DMA(&huart3, g_st3215_rx_buf, ST3215_RX_BUF_SIZE) == HAL_OK) {
                dma_rx_ring_init(&g_st3215_ring, g_st3215_rx_buf, ST3215_RX_BUF_SIZE);
                g_uart3_rx_rearm = 0U;
            }
        } else if ((hdma_usart3_rx.Instance->CR & DMA_SxCR_EN) == 0U) {
            g_uart3_rx_rearm = 1U;
        }
        if (g_pi_poll_requested || startup_now != last_pi_poll_ms) {
            g_pi_poll_requested = 0U;
            last_pi_poll_ms = startup_now;
            /* Ordering contract (pi_transport.h): lap count first, NDTR after. */
            uint32_t pi_laps = g_pi_transport.lap_count;
            uint16_t pi_ndtr = (uint16_t)__HAL_DMA_GET_COUNTER(&hdma_usart6_rx);
            (void)pi_transport_poll(&g_pi_transport, pi_laps, pi_ndtr);
        }

        ddsm_bus_step(&g_ddsm_bus, startup_now);
        /* Drain the ST3215 DMA ring into the bus parser (main-loop context).
         * The absolute producer cursor is reconstructed as lap_count * size
         * + write index (ordering contract in dma_rx_ring.h: lap count read
         * first, NDTR after); a genuine consumer lag past one full ring is
         * billed to overrun_count, and consume() returns only the still-
         * valid oldest bytes. */
        {
            uint32_t laps = g_st3215_ring.lap_count;
            uint16_t ndtr = (uint16_t)__HAL_DMA_GET_COUNTER(&hdma_usart3_rx);
            uint16_t write_idx = (ndtr == 0U) ? ST3215_RX_BUF_SIZE
                                              : (uint16_t)(ST3215_RX_BUF_SIZE - ndtr);
            uint8_t chunk[ST3215_RX_BUF_SIZE];
            uint16_t count;
            dma_rx_ring_update_producer(&g_st3215_ring, laps, write_idx);
            while ((count = dma_rx_ring_consume(&g_st3215_ring,
                                                chunk, ST3215_RX_BUF_SIZE)) > 0U) {
                for (uint16_t i = 0U; i < count; ++i) {
                    ++g_uart3_rx_cnt;
                    st3215_bus_rx_byte_from_dma(&g_st3215_bus, chunk[i], startup_now);
                }
            }
        }
        st3215_bus_step(&g_st3215_bus, startup_now);
        Actuator_Feedback_Snapshot(&left_feedback, &right_feedback, servo_feedback);
        /* Wheel torque authorization for the LQR self-balance loop.
         * Self-balancing is a baseline capability that must work standalone
         * (no Pi), so it is gated only on startup completion + an operational
         * mode + no fault.  INIT is deliberately excluded: the documented
         * state contract keeps the wheel power domain locked (read-only
         * queries) until the safety machine reaches STAND.  Pi link freshness
         * only gates the ACTIVE-mode motion commands, not the balance loop
         * itself. */
        wheel_authorized = (uint8_t)(g_startup_manager.phase == STARTUP_READY &&
                                     g_safety_state.current_mode != STATE_INIT &&
                                     g_safety_state.current_mode != STATE_FAULT);

        runtime_inputs.now_ms = startup_now;
        runtime_inputs.mode = g_safety_state.current_mode;
        runtime_inputs.link_compatible = pi_link_is_compatible();
        runtime_inputs.heartbeat_fresh = pi_link_heartbeat_fresh();
        runtime_inputs.action_fresh = pi_link_action_fresh();
        runtime_inputs.wheel_authorized = wheel_authorized;
        runtime_inputs.wheel_bus_idle = ddsm_bus_is_idle(&g_ddsm_bus);
        runtime_inputs.servo_bus_idle = st3215_bus_is_idle(&g_st3215_bus);
        runtime_outputs = firmware_runtime_step(&firmware_runtime, &runtime_inputs);
        if (runtime_outputs.servo_due) servo_deadline_pending = 1U;

