Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
        if (bmi_init_in_progress) {
            int bmi_result = bmi088_init_step(&g_imu, startup_now);
            if (bmi_result != 0) {
                bmi_init_in_progress = 0U;
            }
        }

        for (int i = 0; i < 4; ++i) {
            if (!device_health_is_fresh(&servo_feedback[i].health,
                                        startup_now,
                                        SAFETY_SERVO_MAX_AGE_MS)) {
                startup_servos_online = 0U;
            }
        }
        startup_inputs.now_ms = startup_now;
        startup_inputs.imu_initialized = g_imu.initialized;
        /* Per-channel IMU validity: a dead accelerometer must not be masked by
         * a live gyro (or vice versa) through the legacy aggregate health. */
        startup_inputs.accel_valid = bmi088_accel_healthy(&g_imu, startup_now,
                                                          SAFETY_IMU_MAX_AGE_MS);
        startup_inputs.gyro_valid = bmi088_gyro_healthy(&g_imu, startup_now,
                                                        SAFETY_IMU_MAX_AGE_MS);
        startup_inputs.wheel_l_online = device_health_is_fresh(&left_feedback.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.wheel_r_online = device_health_is_fresh(&right_feedback.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.servos_online = startup_servos_online;
        startup_inputs.actuator_configured = g_actuator_configured;
        startup_outputs = startup_manager_step(&g_startup_manager, &startup_inputs);

        if (startup_outputs.request_imu_init && !g_imu.initialized && !bmi_init_in_progress) {
            bmi088_begin_init(&g_imu, &hi2c1, startup_now);
            bmi_init_in_progress = 1U;
        }

        if (g_startup_manager.phase == STARTUP_ACTUATOR_DISCOVERY &&
            !g_actuator_configured) {
            int discovery_result = -1;
            if (g_actuator_discovery_step == 0U) {
                /* Bring the motor out of its power-up state first (Protocol-3
                 * mode switching is only honoured once the motor is enabled). */
                discovery_result = ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left,
                                                         0U, startup_now);
            } else if (g_actuator_discovery_step == 1U) {
                /* Select the current (torque) loop.  Protocol-3 form: byte[9]=mode
                 * with no CRC.  Re-asserted while enabled after arming too. */
                discovery_result = ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_left,
                                                       DDSM_MODE_CURRENT, startup_now);
            } else if (g_actuator_discovery_step == 2U) {
                /* Explicit zero-torque clears any stale torque retained across
                 * power cycles so the motor does not spin before the Pi arms. */
                discovery_result = ddsm_bus_queue_torque(&g_ddsm_bus, &g_ddsm_left,
                                                         0.0f, startup_now);
            } else if (g_actuator_discovery_step == 3U) {
                discovery_result = ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right,
                                                         0U, startup_now);
            } else if (g_actuator_discovery_step == 4U) {
                discovery_result = ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_right,
                                                       DDSM_MODE_CURRENT, startup_now);
            } else if (g_actuator_discovery_step == 5U) {
                discovery_result = ddsm_bus_queue_torque(&g_ddsm_bus, &g_ddsm_right,
                                                         0.0f, startup_now);
            } else if (g_actuator_discovery_step == 6U) {
                discovery_result = st3215_bus_queue_torque(
                    &g_st3215_bus, ST3215_BROADCAST_ID, 0U);
            }
            if (g_actuator_discovery_step < 7U && discovery_result == 0) {
                ++g_actuator_discovery_step;
            }
            g_actuator_configured = (uint8_t)(g_actuator_discovery_step >= 7U);
        }

        if (startup_outputs.enable_actuators && !servos_enabled &&
            (int32_t)(startup_now - next_actuator_enable_ms) >= 0) {
            int enable_result = -1;
            if (servo_enable_step < 4U) {
#if SERVO_ZERO_CALIBRATION_MODE
                enable_result = st3215_bus_queue_torque(
                    &g_st3215_bus, (uint8_t)(servo_enable_step + 1U), 0U);
#else
                enable_result = st3215_bus_queue_torque(
                    &g_st3215_bus, (uint8_t)(servo_enable_step + 1U), 1U);
#endif
            }
            if (servo_enable_step < 4U && enable_result == 0) {
                ++servo_enable_step;
            }
            next_actuator_enable_ms = startup_now + 5U;
            servos_enabled = (uint8_t)(servo_enable_step >= 4U);
        }

    /* Wheel power is a separately armed safety domain.  Discovery and
     * zero-current polling run while disabled.  Arming is authorized by the
     * standalone balance conditions only — startup READY, an operational
     * (non-INIT) mode, and no latched fault — because self-balancing is a
     * baseline capability that must not depend on the Pi link; Pi link
     * freshness gates ACTIVE-mode commands (residuals, velocity), never the
     * balance loop itself.  Authorization is revoked whenever any condition
     * drops, which queues the physical disable frames below. */
        if (wheel_authorized && wheel_enable_mask != 0x03U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((wheel_enable_mask & 0x01U) == 0U) {
                if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left, 1U, startup_now) == 0) {
                    wheel_enable_mask |= 0x01U;
                }
            } else if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right, 1U, startup_now) == 0) {
                wheel_enable_mask |= 0x02U;
            }
        } else if (!wheel_authorized && wheel_enable_mask != 0U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((wheel_enable_mask & 0x01U) != 0U) {
                if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left, 0U, startup_now) == 0) {
                    wheel_enable_mask &= (uint8_t)~0x01U;
                }
            } else if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right, 0U, startup_now) == 0) {
                wheel_enable_mask &= (uint8_t)~0x02U;
            }
        }

        /* Once both wheels are armed, re-assert the current-loop mode on any
         * wheel that has not yet received it while enabled.  Mode switching is
         * only reliably honoured by the DDSM315 after the motor is enabled. */
        if (g_actuator_configured && wheel_enable_mask == 0x03U &&
            g_wheel_mode_sent != 0x03U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((g_wheel_mode_sent & 0x01U) == 0U) {
                if (ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_left,
                                        DDSM_MODE_CURRENT, startup_now) == 0) {
                    g_wheel_mode_sent |= 0x01U;
                }
            } else if ((g_wheel_mode_sent & 0x02U) == 0U) {
                if (ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_right,
                                        DDSM_MODE_CURRENT, startup_now) == 0) {
                    g_wheel_mode_sent |= 0x02U;
                }
            }
        }

        if (startup_outputs.fault_requested) {
            safety_state_trigger_fault(FAULT_INIT);
        }

