Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
        /* Reaching this point proves the scheduler is alive even before DRDY. */
        HAL_IWDG_Refresh(&hiwdg);

        /* ================================================================
         * 250 Hz control section (HAL_GetTick deadline; deliberately
         * independent of the gyro data-ready interrupt).  The whole
         * sequence -- safety state machine, actuator-supervisor verdict,
         * wheel output gate, LQR computation, balance trace -- runs inside
         * control_section_step (host-testable); the scheduler samples its
         * inputs from the loop-local snapshots and applies its outputs for
         * the dispatch layer.  If the IMU dies, imu_fresh goes stale and
         * the debounced freshness fault latches FAULT here regardless of
         * DRDY.
         * ================================================================ */
        if (runtime_outputs.control_due &&
            g_startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY) {
            ControlSectionInputs_t cs_in;
            ControlSectionOutputs_t cs_out;
            uint32_t cs_now = HAL_GetTick();
            uint8_t servos_fresh = 1U;
            uint8_t hold_tx_recent = (uint8_t)(
                servos_enabled &&
                (uint32_t)(cs_now - g_leg_hold_tx_ms) <= LEG_HOLD_MAX_AGE_MS);
            float max_temp = g_imu.temperature;
            uint32_t sent_age;
            for (int i = 0; i < 4; ++i) {
                if (!device_health_is_fresh(&servo_feedback[i].health,
                                            cs_now, SAFETY_SERVO_MAX_AGE_MS)) {
                    servos_fresh = 0U;
                }
                if (servo_feedback[i].temperature_c > max_temp) {
                    max_temp = servo_feedback[i].temperature_c;
                }
            }
            memset(&cs_in, 0, sizeof(cs_in));
            cs_in.now_ms = cs_now;
            cs_in.runtime = runtime_outputs;
            cs_in.imu_control_valid = g_imu_control_valid;
            cs_in.pitch_rad = g_body_pitch;
            cs_in.pitch_rate_rad_s = g_body_pitch_rate;
            cs_in.wheel_vel_l_rads = WHEEL_DIR_L * left_feedback.velocity_rads;
            cs_in.wheel_vel_r_rads = WHEEL_DIR_R * right_feedback.velocity_rads;
            cs_in.yaw_rad = g_mahony.yaw;
            cs_in.yaw_rate_rads = g_body_gyro[2];
            cs_in.max_temp_c = max_temp;
            cs_in.imu_fresh = device_health_is_fresh(&g_imu.health, cs_now,
                                                     SAFETY_IMU_MAX_AGE_MS);
            cs_in.wheel_l_fresh = device_health_is_fresh(&left_feedback.health,
                                                         cs_now,
                                                         SAFETY_WHEEL_MAX_AGE_MS);
            cs_in.wheel_r_fresh = device_health_is_fresh(&right_feedback.health,
                                                         cs_now,
                                                         SAFETY_WHEEL_MAX_AGE_MS);
            cs_in.servos_fresh = servos_fresh;
            cs_in.requested_mode = g_pi_cmd_heartbeat.mode_request;
            cs_in.startup_ready = servos_enabled;
            cs_in.actuator_configured = g_actuator_configured;
            cs_in.wheel_authorized = wheel_authorized;
            cs_in.wheel_bus_idle = runtime_inputs.wheel_bus_idle;
            cs_in.servo_bus_idle = runtime_inputs.servo_bus_idle;
            cs_in.link_compatible = pi_link_is_compatible();
            cs_in.heartbeat_fresh = pi_link_heartbeat_fresh();
            cs_in.action_fresh = pi_link_action_fresh();
            cs_in.leg_hold_tx_recent = hold_tx_recent;
            cs_in.leg_feedback_fresh = startup_servos_online;
            cs_in.leg_posture_safe = (uint8_t)(fabsf(g_body_pitch) <= PITCH_FADE_END_RAD);
            cs_in.servo_enable_verified = servos_enabled;
            cs_in.wheel_enable_verified = (uint8_t)(wheel_enable_mask == 0x03U);
            cs_in.wheel_mode_complete = (uint8_t)(g_wheel_mode_sent == 0x03U);
            Pi_Command_Snapshot(&cs_in.heartbeat, &cs_in.action);
            cs_in.startup_phase = (uint32_t)g_startup_manager.phase;
            cs_in.imu_age_ms = Device_Age_Ms(&g_imu.health, cs_now);
            cs_in.wheel_left_age_ms = Device_Age_Ms(&left_feedback.health, cs_now);
            cs_in.wheel_right_age_ms = Device_Age_Ms(&right_feedback.health, cs_now);
            sent_age = cs_now - g_sent_tau_ms;
            cs_in.wheel_sent_age_ms =
                (uint16_t)(sent_age > UINT16_MAX ? UINT16_MAX : sent_age);
            cs_in.feedback_torque_left_nm = WHEEL_DIR_L * left_feedback.torque;
            cs_in.feedback_torque_right_nm = WHEEL_DIR_R * right_feedback.torque;
            cs_in.sent_torque_left_nm = g_sent_tau_l;
            cs_in.sent_torque_right_nm = g_sent_tau_r;

            cs_out = control_section_step(&g_control_section, &cs_in);
            g_wheel_output_gate = cs_out.wheel_output_gate;
            g_ctrl_tau_l = cs_out.torque_left_nm;
            g_ctrl_tau_r = cs_out.torque_right_nm;

            if (cs_out.fault_entry_edge) {
                /* FAULT entry resets the one-shot enable bookkeeping.  The
                 * FAULT paths physically disable servo torque and queue
                 * wheel disables, so the software must not keep claiming
                 * "enabled/verified": the 50 Hz disable sequence becomes
                 * runnable again (fault_servo_disable_idx), the servo
                 * re-enable path re-runs on recovery (servo_enable_step/
                 * servos_enabled), and wheel current-loop mode is
                 * re-asserted after re-arming (g_wheel_mode_sent).
                 * wheel_enable_mask clears itself through the disable queue
                 * when authorization drops. */
                servo_enable_step = 0U;
                servos_enabled = 0U;
                fault_servo_disable_idx = 0U;
                g_wheel_mode_sent = 0U;
            }
        }
        /* Wheel bus dispatch at the DDSM315 bus limit.
         * At 115200 baud a 10-byte frame takes ~0.87 ms TX + ~0.87 ms RX;
         * the 4 ms spacing matches the original bus scheduling and gives each
         * wheel a 125 Hz update rate.  Removing it caused RS485 overruns.
         * Positioned after the 250 Hz control section so a frame on the wire
         * never predates the verdict and torque computed in the same period;
         * g_wheel_output_gate is the persistent authorization, and closed
         * states keep polling (zero-torque in FAULT, plain queries otherwise)
         * so wheel feedback freshness survives every revocation. */
        if (g_actuator_configured && ddsm_bus_is_idle(&g_ddsm_bus) &&
            (int32_t)(startup_now - next_wheel_tx_ms) >= 0) {
            int wheel_result;
            uint8_t sent_torque_frame = 0U;
            DDSM_State_t *wheel = next_wheel_is_right ? &g_ddsm_right : &g_ddsm_left;
            float torque = next_wheel_is_right
                         ? WHEEL_DIR_R * g_ctrl_tau_r
                         : WHEEL_DIR_L * g_ctrl_tau_l;
            if (g_wheel_output_gate) {
                wheel_result = ddsm_bus_queue_torque(&g_ddsm_bus, wheel,
                                                     torque, startup_now);
                sent_torque_frame = (uint8_t)(wheel_result == 0);
            } else if (g_safety_state.current_mode == STATE_FAULT) {
                wheel_result = ddsm_bus_queue_torque(&g_ddsm_bus, wheel,
                                                     0.0f, startup_now);
            } else {
                wheel_result = ddsm_bus_queue_query(&g_ddsm_bus, wheel, startup_now);
            }
            if (wheel_result == 0) {
                next_wheel_is_right ^= 1U;
                next_wheel_tx_ms = startup_now + 4U;
                if (sent_torque_frame) {
                    /* Body-frame value of the accepted frame, for the trace's
                     * "sent" channels (distinct from the LQR target). */
                    if (next_wheel_is_right) {
                        g_sent_tau_l = g_ctrl_tau_l;
                    } else {
                        g_sent_tau_r = g_ctrl_tau_r;
                    }
                    g_sent_tau_ms = startup_now;
                }
            }
        }

        /* Soft real-time scheduler aligned to system ticks (1ms resolution) */
        if (g_system_ticks != last_tick) {
            /* Use the actual elapsed time; blocking bus I/O can skip ticks.
             * Clamp the fusion step: after a long main-loop stall (e.g. an
             * interrupt storm) dticks spans hundreds of ms, and integrating
             * the quaternion with dt~1 s would blow up the attitude. */
            uint32_t dticks = g_system_ticks - last_tick;
            last_tick = g_system_ticks;
            float fusion_dt = (float)dticks * 0.001f;
            if (fusion_dt > 0.02f) fusion_dt = 0.02f;

            /* DRDY can arrive while the BMI088 register sequence is still in
             * progress.  Do not read or calibrate from an uninitialized IMU. */
            if (!g_imu.initialized) {
                continue;
            }

            /* 1. Read IMU sensors (safe to do here in the main loop background).
             * Return codes matter: a failed channel keeps its previous sample
             * and must not be fused as if it were fresh. */
            (void)bmi088_read_accel(&g_imu);
            (void)bmi088_read_gyro(&g_imu);

