Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
            /* Refresh chip temperature at low rate (~10 Hz) for safety/telemetry */
            if (++temp_refresh_counter >= 100) {
                temp_refresh_counter = 0;
                bmi088_read_temp(&g_imu);
            }

            BMI088SampleValidity_t imu_validity;
            bmi088_get_sample_validity(&g_imu, HAL_GetTick(),
                                       BMI088_DEFAULT_MAX_AGE_MS, &imu_validity);
            uint8_t accel_ok = (uint8_t)(imu_validity.accel_valid &&
                                         imu_validity.accel_fresh);
            uint8_t gyro_ok = (uint8_t)(imu_validity.gyro_valid &&
                                        imu_validity.gyro_fresh);

            float gx = g_imu.gyro[0];
            float gy = g_imu.gyro[1];
            float gz = g_imu.gyro[2];

            /* 2. Run sensor fusion update with per-channel validity. */
            if (g_safety_state.is_gyro_calibrated) {
                gx -= g_safety_state.gyro_calib_offset[0];
                gy -= g_safety_state.gyro_calib_offset[1];
                gz -= g_safety_state.gyro_calib_offset[2];
            }
            /* Always attempt the fusion update.  Mahony is accel-referenced, so
             * running with a zero gyro offset at start is safe; the bias
             * estimate is refined in the background (below) once the robot
             * settles.  An invalid gyro is rejected inside the filter and
             * revokes control validity instead of integrating garbage. */
            MahonyUpdateStatus_t fuse_status = mahony_update_validated(
                &g_mahony,
                g_imu.accel[0], g_imu.accel[1], g_imu.accel[2],
                gx, gy, gz, fusion_dt, accel_ok, gyro_ok);
            g_imu_control_valid = (uint8_t)(
                fuse_status == MAHONY_UPDATE_FULL ||
                (fuse_status == MAHONY_UPDATE_GYRO_ONLY && g_mahony.control_valid));

            if (!g_imu_control_valid) {
                /* Attitude no longer trustworthy: drop balance authority now.
                 * The ms-deadline safety block latches FAULT_IMU via freshness
                 * once the failure outlives its debounce window.  Telemetry
                 * slots below still run on the last published attitude. */
                g_ctrl_tau_l = 0.0f;
                g_ctrl_tau_r = 0.0f;
            }

            if (g_imu_control_valid) {
                if (!g_safety_state.is_gyro_calibrated && gyro_ok) {
                    safety_state_gyro_calib_update(gx, gy, gz, HAL_GetTick());
                }
                g_body_gyro[0] = gx;
                g_body_gyro[1] = gy;
                g_body_gyro[2] = gz;

                /* Balance-relevant tilt & rate mapped to the physical IMU
                 * mounting.  Pitch rate uses the bias-corrected gyro (offset is
                 * 0 until calibrated). */
                float body_pitch = ATT_PITCH(&g_mahony);
                float body_pitch_rate = ATT_PITCH_RATE_SIGN *
                    (g_imu.gyro[ATT_PITCH_RATE_IDX] - g_safety_state.gyro_calib_offset[ATT_PITCH_RATE_IDX]);
                /* Low-pass filter pitch rate: the raw gyro Y has broadband noise
                 * that K3 amplifies into torque chatter.  A 35 Hz one-pole filter
                 * preserves the balance-relevant dynamics while cutting noise. */
                g_pitch_rate_filt += PITCH_RATE_FILTER_ALPHA *
                    (body_pitch_rate - g_pitch_rate_filt);
                body_pitch_rate = g_pitch_rate_filt;

                /* Publish the latest attitude for the ms-deadline safety block. */
                g_body_pitch = body_pitch;
                g_body_pitch_rate = body_pitch_rate;
            }

            /* 3. Telemetry slots on the 1 kHz tick cadence.  Control and
             * trace live in the 250 Hz control section above; this block only
             * publishes fusion results and streams telemetry, so a stopped
             * DRDY freezes telemetry but never fault detection or tracing. */
            uint8_t slot = last_tick % 4;

            /* --- Slot 2: Queue telemetry data to Raspberry Pi 5 --- */
            if (slot == 2) {
                pi_link_send_imu(&huart6, 
                                 g_mahony.roll, 
                                 g_mahony.pitch, 
                                 g_mahony.yaw, 
                                  g_body_gyro[0],
                                  g_body_gyro[1],
                                  g_body_gyro[2]);

                /* Report joint feedback in the shared sim/body frame so it is
                 * symmetric with the command contract (mirror + zero applied). */
                float servo_pos[4], servo_vel[4], servo_cur[4];
                for (int i = 0; i < 4; i++) {
                    servo_pos[i] = servo_tick_to_angle(servo_feedback[i].position_tick, (uint8_t)i);
                    servo_vel[i] = (float)servo_direction((uint8_t)i) * servo_feedback[i].velocity_rads;
                    servo_cur[i] = servo_feedback[i].current_a;
                }

                /* Single-turn wheel angle (raw); velocity/torque mapped to body frame */
                float wheel_l_pos = left_feedback.position_rad;
                float wheel_r_pos = right_feedback.position_rad;

                pi_link_send_joints(&huart6,
                                    wheel_l_pos, WHEEL_DIR_L * left_feedback.velocity_rads, WHEEL_DIR_L * left_feedback.torque,
                                    wheel_r_pos, WHEEL_DIR_R * right_feedback.velocity_rads, WHEEL_DIR_R * right_feedback.torque,
                                    servo_pos, servo_vel, servo_cur);
            }

            /* --- Slot 3: Diagnostic packages & main controller logic --- */
            else if (slot == 3) {
                /* Battery sensing is not populated on this hardware.  Zero is
                 * the protocol sentinel for unavailable, not an undervoltage.
                 * The BMI088 covers -40..85 degC; saturate before the uint8
                 * field because a negative float-to-unsigned cast is UB and
                 * would wrap (e.g. -5 degC -> 251) on a cold bench. */
                uint8_t diag_temp_c =
                    (g_imu.temperature < 0.0f) ? 0U :
                    ((g_imu.temperature > 255.0f) ? 255U
                                                  : (uint8_t)g_imu.temperature);
                pi_link_send_diag(&huart6, 0U, diag_temp_c,
                                  safety_state_legacy_fault_mask());

                if (++health_telemetry_divider >= 25U) {
                    Pi_HealthTelemetry_t health;
                    int i;
                    uint32_t health_now = HAL_GetTick();
                    health_telemetry_divider = 0U;
                    health.fault_mask = g_safety_state.fault_mask;
                    health.mode = (uint8_t)g_safety_state.current_mode;
                    health.reset_cause = g_reset_cause;
                    health.imu_age_ms = Device_Age_Ms(&g_imu.health, health_now);
                    health.wheel_l_age_ms = Device_Age_Ms(&left_feedback.health, health_now);
                    health.wheel_r_age_ms = Device_Age_Ms(&right_feedback.health, health_now);
                    health.imu_errors = Device_Error_Count(&g_imu.health);
                    health.wheel_l_errors = Device_Error_Count(&left_feedback.health);
                    health.wheel_r_errors = Device_Error_Count(&right_feedback.health);
                    health.wheel_l_timeout_errors = Device_Timeout_Count(&left_feedback.health);
                    health.wheel_l_checksum_errors = Device_Checksum_Count(&left_feedback.health);
                    health.wheel_l_protocol_errors = Device_Protocol_Count(&left_feedback.health);
                    health.wheel_r_timeout_errors = Device_Timeout_Count(&right_feedback.health);
                    health.wheel_r_checksum_errors = Device_Checksum_Count(&right_feedback.health);
                    health.wheel_r_protocol_errors = Device_Protocol_Count(&right_feedback.health);
                    for (i = 0; i < 4; ++i) {
                        health.servo_age_ms[i] = Device_Age_Ms(&servo_feedback[i].health,
                                                               health_now);
                        health.servo_errors[i] = Device_Error_Count(&servo_feedback[i].health);
                    }
                    (void)pi_link_send_health(&huart6, &health);
                }

                if (g_safety_state.current_mode == STATE_FAULT) {
                    pi_link_send_fault(&huart6, safety_state_legacy_fault_mask());
                }
            }
        }

        /* --- 50 Hz Background Loop: ST3215 Servo Control --- */
        uint32_t current_time = HAL_GetTick();
        if (g_actuator_configured && servo_deadline_pending) {
            uint8_t ids[4] = {SERVO_LF_ID, SERVO_RF_ID, SERVO_LB_ID, SERVO_RB_ID};
            /* A servo deadline is "served" once a frame was actually queued,
             * the mode has nothing to transmit (INIT), or the request is
             * statically unsolvable (IK rejected its already-clamped inputs —
             * deterministic, so an immediate retry cannot help).  A BUSY servo
             * bus keeps the deadline pending so the write is retried on the
             * next scheduler pass instead of being dropped for a whole 20 ms
             * period.  Five dropped periods would expire LEG_HOLD_MAX_AGE_MS,
             * demote the actuator supervisor, and close the wheel gate for
             * ~100 ms on a balancing robot — with one degraded servo timing
             * out ~10 ms of every 24 ms poll cycle that happened often enough
             * to matter.  The wheel dispatch layer already had this retry
             * shape (next_wheel_tx_ms only advances on success). */
            uint8_t servo_deadline_served = 0U;

#if SERVO_ZERO_CALIBRATION_MODE
            /* Position commands are intentionally suppressed. System setup
             * has already disabled torque; feedback polling below still runs. */
            (void)ids;
            servo_deadline_served = 1U;
#else
            if (g_safety_state.current_mode == STATE_ACTIVE) {
                /* Pi supplies bounded workspace residuals.  Project them through
                 * the same dwell-relative (Qx,D0) five-bar IK as the simulator. */
                Pi_Command_Heartbeat_t hb;
                Pi_Command_Action_t act;
                Pi_Command_Snapshot(&hb, &act);
                int16_t pos_ticks[4];
                uint16_t speed_ticks[4] = {2000, 2000, 2000, 2000};
                uint8_t accels[4] = {50, 50, 50, 50};
                float action_scale = runtime_outputs.residual_allowed ? 1.0f : 0.0f;
                float d0_max = (fabsf(hb.target_velocity) > D0_GATE_V_THRESH ||
                                fabsf(hb.target_yaw_rate) > D0_GATE_W_THRESH)
                                   ? D0_GATE_MAX_HIGH * 0.001f : KIN_MAX_LEG_D0;
                float roll_term_mm = -(KUAFU_ROLL_KP * g_mahony.roll +
                                       KUAFU_ROLL_KD * g_body_gyro[0]);
                float d0_l = hb.target_leg_d0 + 0.001f * roll_term_mm / 2.0f +
                             0.001f * D0_RESIDUAL_SCALE_MM * action_scale * act.d0_l;
                float d0_r = hb.target_leg_d0 - 0.001f * roll_term_mm / 2.0f +
                             0.001f * D0_RESIDUAL_SCALE_MM * action_scale * act.d0_r;
                if (d0_l < KIN_MIN_LEG_D0) d0_l = KIN_MIN_LEG_D0;
                if (d0_l > d0_max) d0_l = d0_max;
                if (d0_r < KIN_MIN_LEG_D0) d0_r = KIN_MIN_LEG_D0;
                if (d0_r > d0_max) d0_r = d0_max;
                float qA_l, qB_l, qA_r, qB_r;
                if (kinematics_solve_ik_xy(QX_RESIDUAL_SCALE_MM * 0.001f * action_scale * act.qx_l, d0_l, &qA_l, &qB_l) == 0 &&
                    kinematics_solve_ik_xy(QX_RESIDUAL_SCALE_MM * 0.001f * action_scale * act.qx_r, d0_r, &qA_r, &qB_r) == 0) {
                    pos_ticks[0] = servo_angle_to_tick(qA_l, 0);
                    pos_ticks[1] = servo_angle_to_tick(qA_r, 1);
                    pos_ticks[2] = servo_angle_to_tick(qB_l, 2);
                    pos_ticks[3] = servo_angle_to_tick(qB_r, 3);
                    if (st3215_bus_queue_sync_write(&g_st3215_bus, ids, 4U,
                                                    pos_ticks, speed_ticks, accels) == 0) {
                        g_leg_hold_tx_ms = current_time;
                        servo_deadline_served = 1U;
                    }
                } else {
                    servo_deadline_served = 1U; /* unsolvable request: skip */
                }
            }
            else if (g_safety_state.current_mode == STATE_STAND ||
                     g_safety_state.current_mode == STATE_CLIMB) {
                /* Standing/Climbing virtual height mode */
                Pi_Command_Heartbeat_t hb;
                Pi_Command_Action_t act;
                Pi_Command_Snapshot(&hb, &act);
                (void)act;

                float q_hip_A = 0.0f; /* A chain, pivot x=-c (LF, RF) */
                float q_hip_B = 0.0f; /* B chain, pivot x=+c (LB, RB) */

                /* Compute inverse kinematics mapping for target height */
                if (kinematics_solve_ik(hb.target_leg_d0, &q_hip_A, &q_hip_B) == 0) {
                    int16_t pos_ticks[4];
                    uint16_t speed_ticks[4] = {1500, 1500, 1500, 1500};
                    uint8_t accels[4] = {30, 30, 30, 30};

                    pos_ticks[0] = servo_angle_to_tick(q_hip_A, 0); /* LF (A chain) */
                    pos_ticks[1] = servo_angle_to_tick(q_hip_A, 1); /* RF (A chain) */
                    pos_ticks[2] = servo_angle_to_tick(q_hip_B, 2); /* LB (B chain) */
                    pos_ticks[3] = servo_angle_to_tick(q_hip_B, 3); /* RB (B chain) */

                    if (st3215_bus_queue_sync_write(&g_st3215_bus, ids, 4U,
                                                    pos_ticks, speed_ticks, accels) == 0) {
                        g_leg_hold_tx_ms = current_time;
                        servo_deadline_served = 1U;
                    }
                } else {
                    servo_deadline_served = 1U; /* unsolvable request: skip */
                }
            }
            else if (g_safety_state.current_mode == STATE_FAULT) {
                /* Lockdown: disable servo torque once to allow gravity lock.
                 * Sending the disable every 50 Hz cycle floods the full-duplex
                 * bus with echo bytes that desync subsequent read queries, so a
                 * one-shot flag is used instead of repeated transmission.
                 * A busy bus leaves the deadline pending so the (single next)
                 * disable frame is retried on the following pass. */
                if (fault_servo_disable_idx >= 4U) {
                    servo_deadline_served = 1U; /* one-shot complete */
                } else if (st3215_bus_queue_torque(&g_st3215_bus,
                                                   ids[fault_servo_disable_idx],
                                                   0U) == 0) {
                    ++fault_servo_disable_idx;
                    servo_deadline_served = 1U;
                }
            }
            else {
                /* INIT: no leg command on the wire; the deadline is served. */
                servo_deadline_served = 1U;
            }
#endif
            if (servo_deadline_served) {
                servo_deadline_pending = 0U;
            }
        }

        /* Poll every servo round-robin, including offline devices, so a valid
         * frame can restore health after line noise or a temporary disconnect.
         * 6 ms spacing (24 ms full cycle) deliberately mismatches the 50 Hz
         * (20 ms) sync-write period: at 5 ms the cycles phase-locked and the
         * same servo always landed right after the write burst, eating every
         * delayed reply (observed: S1 timeout bursts, S2-S4 clean). */
        current_time = HAL_GetTick();
        if (g_startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY &&
            current_time - last_servo_query_ms >= 6U &&
            st3215_bus_queue_read(&g_st3215_bus,
                                  &g_servos[active_servo_query_idx],
                                  g_safety_state.current_mode == STATE_INIT
                                      ? 0U : SERVO_FAIL_LIMIT,
                                  current_time) == 0) {
            last_servo_query_ms = current_time;
            active_servo_query_idx = (active_servo_query_idx + 1) % 4;
        }
    }
}

/**
 * @brief EXTI1 callback: triggered at 1kHz by Gyro DRDY pin (PB1).
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == IMU_INT_PIN) {
        g_system_ticks++;
        /* Highest-priority context: runs even when a UART interrupt storm
         * starves SysTick and the main loop, so stall forensics still work. */
        main_loop_stall_check();
    }
}

/**
 * @brief Snapshots the Pi command state.  Frames are parsed in main-loop
 *        context (pi_transport_poll); the short IRQ mask keeps the copy
 *        atomic against any future ISR-side producer at zero cost.
 */
static void Pi_Command_Snapshot(Pi_Command_Heartbeat_t *hb, Pi_Command_Action_t *act) {
    HAL_NVIC_DisableIRQ(USART6_IRQn);
    *hb = g_pi_cmd_heartbeat;
    *act = g_pi_cmd_action;
    HAL_NVIC_EnableIRQ(USART6_IRQn);
}

/**
 * @brief System Clock Configuration to 168MHz (from 8MHz HSE)
 */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 8;
    RCC_OscInitStruct.PLL.PLLN = 336;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2; /* SYSCLK = 168MHz */
    RCC_OscInitStruct.PLL.PLLQ = 7;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4; /* APB1 = 42MHz */
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2; /* APB2 = 84MHz */
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
        Error_Handler();
    }
}

