Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
static void MX_GPIO_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    /* Configure EXTI1 Interrupt Pin (PB1) */
    GPIO_InitStruct.Pin = IMU_INT_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING; /* Gyro INT3 goes high when data ready */
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(IMU_INT_PORT, &GPIO_InitStruct);
}

static void MX_DMA_Init(void) {
    __HAL_RCC_DMA2_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();

    /* DMA2_Stream1_Channel5 for USART6_RX */
    HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

    /* DMA1_Stream1_Channel4 for USART3_RX */
    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
}

static void MX_IWDG_Init(void) {
    hiwdg.Instance = IWDG;
    /* ~1.0 s window: LSI ~32 kHz / 16 = 2 kHz, reload 2000.  The previous
     * 64/4095 setting (~8.2 s) let a hung main loop hold the last wheel
     * torque far too long for a self-balancing robot. */
    hiwdg.Init.Prescaler = IWDG_PRESCALER_16;
    hiwdg.Init.Reload = 2000;
    if (HAL_IWDG_Init(&hiwdg) != HAL_OK) {
        Error_Handler();
    }
}

static void MX_I2C1_Init(void) {
    hi2c1.Instance = I2C1;
    hi2c1.Init.ClockSpeed = 400000; /* 400 kHz Fast Mode */
    hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    
    IMU_GPIO_CLK_EN();
    IMU_I2C_CLK_EN();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = IMU_SCL_PIN | IMU_SDA_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD; /* Open Drain */
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = IMU_I2C_AF;
    HAL_GPIO_Init(IMU_SCL_PORT, &GPIO_InitStruct);

    if (HAL_I2C_Init(&hi2c1) != HAL_OK) {
        Error_Handler();
    }
}

static void MX_USART1_UART_Init(void) {
    huart1.Instance = DEBUG_USART;
    huart1.Init.BaudRate = 115200;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;

    DEBUG_GPIO_CLK_EN();
    DEBUG_USART_CLK_EN();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = DEBUG_TX_PIN | DEBUG_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = DEBUG_USART_AF;
    HAL_GPIO_Init(DEBUG_TX_PORT, &GPIO_InitStruct);

    if (HAL_UART_Init(&huart1) != HAL_OK) {
        Error_Handler();
    }
}

static void MX_USART2_UART_Init(void) {
    huart2.Instance = DDSM_USART;
    huart2.Init.BaudRate = 115200;
    huart2.Init.WordLength = UART_WORDLENGTH_8B;
    huart2.Init.StopBits = UART_STOPBITS_1;
    huart2.Init.Parity = UART_PARITY_NONE;
    huart2.Init.Mode = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;

    DDSM_GPIO_CLK_EN();
    DDSM_USART_CLK_EN();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = DDSM_TX_PIN | DDSM_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = DDSM_USART_AF;
    HAL_GPIO_Init(DDSM_TX_PORT, &GPIO_InitStruct);

    if (HAL_UART_Init(&huart2) != HAL_OK) {
        Error_Handler();
    }
    HAL_NVIC_SetPriority(USART2_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
}

static void Actuator_Feedback_Snapshot(DDSM_State_t *left,
                                       DDSM_State_t *right,
                                       ST3215_State_t servos[4]) {
    int i;
    HAL_NVIC_DisableIRQ(USART2_IRQn);
    HAL_NVIC_DisableIRQ(USART3_IRQn);
    *left = g_ddsm_left;
    *right = g_ddsm_right;
    for (i = 0; i < 4; ++i) servos[i] = g_servos[i];
    HAL_NVIC_EnableIRQ(USART3_IRQn);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
}

static uint8_t Read_Reset_Cause(void) {
    uint8_t cause = 0U;
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST)) cause |= (1U << 0);
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST)) cause |= (1U << 1);
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST)) cause |= (1U << 2);
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST)) cause |= (1U << 3);
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST)) cause |= (1U << 4);
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST)) cause |= (1U << 5);
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_BORRST)) cause |= (1U << 6);
    __HAL_RCC_CLEAR_RESET_FLAGS();
    return cause;
}

static uint16_t Device_Age_Ms(const DeviceHealth_t *health, uint32_t now_ms) {
    uint32_t age;
    if (health == NULL || health->last_valid_ms == 0U) return UINT16_MAX;
    age = (uint32_t)(now_ms - health->last_valid_ms);
    return age > UINT16_MAX ? UINT16_MAX : (uint16_t)age;
}

static uint16_t Device_Error_Count(const DeviceHealth_t *health) {
    uint32_t total;
    if (health == NULL) return UINT16_MAX;
    total = (uint32_t)health->timeout_count + health->checksum_count + health->protocol_count;
    return total > UINT16_MAX ? UINT16_MAX : (uint16_t)total;
}

static uint16_t Device_Timeout_Count(const DeviceHealth_t *health) {
    return (health == NULL) ? UINT16_MAX : health->timeout_count;
}

static uint16_t Device_Checksum_Count(const DeviceHealth_t *health) {
    return (health == NULL) ? UINT16_MAX : health->checksum_count;
}

static uint16_t Device_Protocol_Count(const DeviceHealth_t *health) {
    return (health == NULL) ? UINT16_MAX : health->protocol_count;
}

static void MX_USART3_UART_Init(void) {
    huart3.Instance = SERVO_USART;
    huart3.Init.BaudRate = 1000000;
    huart3.Init.WordLength = UART_WORDLENGTH_8B;
    huart3.Init.StopBits = UART_STOPBITS_1;
    huart3.Init.Parity = UART_PARITY_NONE;
    huart3.Init.Mode = UART_MODE_TX_RX;
    huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart3.Init.OverSampling = UART_OVERSAMPLING_16;

    SERVO_GPIO_CLK_EN();
    SERVO_USART_CLK_EN();

    /* Full-duplex: separate TX (PB10) and RX (PB11) lines. The ST3215 bus servos
     * attach through a Waveshare Bus Servo Adapter (A), which converts the
     * single-wire half-duplex servo bus into a 2-wire UART (TXD/RXD). Both pins
     * are AF push-pull; the adapter board drives its own lines. */
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = SERVO_TX_PIN | SERVO_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = SERVO_USART_AF;
    HAL_GPIO_Init(SERVO_TX_PORT, &GPIO_InitStruct);

    if (HAL_UART_Init(&huart3) != HAL_OK) {
        Error_Handler();
    }

    /* DMA1_Stream1_Channel4 circular RX (main loop consumes the ring). */
    hdma_usart3_rx.Instance = DMA1_Stream1;
    hdma_usart3_rx.Init.Channel = DMA_CHANNEL_4;
    hdma_usart3_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_usart3_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_usart3_rx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_usart3_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_usart3_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_usart3_rx.Init.Mode = DMA_CIRCULAR;
    hdma_usart3_rx.Init.Priority = DMA_PRIORITY_HIGH;
    hdma_usart3_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_usart3_rx) != HAL_OK) {
        Error_Handler();
    }
    __HAL_LINKDMA(&huart3, hdmarx, hdma_usart3_rx);
    if (HAL_UART_Receive_DMA(&huart3, g_st3215_rx_buf, ST3215_RX_BUF_SIZE) != HAL_OK) {
        Error_Handler();
    }

