Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
    /* USART3 IRQ stays enabled for TX-complete (TX remains interrupt-driven). */
    HAL_NVIC_SetPriority(USART3_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(USART3_IRQn);
}

static void MX_USART6_UART_Init(void) {
    huart6.Instance = PI_USART;
    huart6.Init.BaudRate = 921600;
    huart6.Init.WordLength = UART_WORDLENGTH_8B;
    huart6.Init.StopBits = UART_STOPBITS_1;
    huart6.Init.Parity = UART_PARITY_NONE;
    huart6.Init.Mode = UART_MODE_TX_RX;
    huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart6.Init.OverSampling = UART_OVERSAMPLING_16;

    PI_GPIO_CLK_EN();
    PI_USART_CLK_EN();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = PI_TX_PIN | PI_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = PI_USART_AF;
    HAL_GPIO_Init(PI_TX_PORT, &GPIO_InitStruct);

    if (HAL_UART_Init(&huart6) != HAL_OK) {
        Error_Handler();
    }

    /* Associate DMA handle to USART6 RX */
    hdma_usart6_rx.Instance = DMA2_Stream1;
    hdma_usart6_rx.Init.Channel = DMA_CHANNEL_5;
    hdma_usart6_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_usart6_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_usart6_rx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_usart6_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_usart6_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    /* The Pi RX stream is consumed incrementally from a DMA ring. */
    hdma_usart6_rx.Init.Mode = DMA_CIRCULAR;
    hdma_usart6_rx.Init.Priority = DMA_PRIORITY_HIGH;
    hdma_usart6_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_usart6_rx) != HAL_OK) {
        Error_Handler();
    }

    __HAL_LINKDMA(&huart6, hdmarx, hdma_usart6_rx);

    /* Enable USART6 IRQ */
    HAL_NVIC_SetPriority(USART6_IRQn, 1, 1);
    HAL_NVIC_EnableIRQ(USART6_IRQn);
}

/**
 * @brief USART6 global interrupt handler. Processes IDLE line detections.
 */
void USART6_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&huart6, UART_FLAG_IDLE) != RESET) {
        __HAL_UART_CLEAR_IDLEFLAG(&huart6);
        g_pi_poll_requested = 1U;
    }
    HAL_UART_IRQHandler(&huart6);
}

void USART2_IRQHandler(void) {
    HAL_UART_IRQHandler(&huart2);
}

void USART3_IRQHandler(void) {
    /* Swallow NE/FE before HAL sees them: in DMA reception HAL treats ANY
     * flagged error as blocking and aborts the whole circular RX stream
     * (UART_DMAAbortOnError), so one noisy byte on this half-duplex bus cost
     * a ~1 ms blind window that corrupted every in-flight reply (observed:
     * ~25%% servo poll failures, freshness FAULT bursts).  A framing/noise
     * blip now costs at most one garbage byte; the parser resynchronizes on
     * the 0xFFFF header and the checksum drops a single frame.  Reading SR
     * then DR clears the flags; DR is normally empty here because the DMA
     * drains RXNE immediately, and stealing a byte in the rare race costs
     * exactly one frame as well.  ORE still goes through the HAL abort path
     * (g_uart3_rx_rearm in the main loop restores the stream). */
    uint32_t sr = huart3.Instance->SR;
    if ((sr & (USART_SR_NE | USART_SR_FE)) != 0U) {
        volatile uint32_t drained = huart3.Instance->DR;
        (void)drained;
    }
    HAL_UART_IRQHandler(&huart3);
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart) {
    if (huart == &huart2) {
        ddsm_bus_on_tx_complete_at(&g_ddsm_bus, HAL_GetTick());
    } else if (huart == &huart3) {
        st3215_bus_on_tx_complete(&g_st3215_bus);
    } else if (huart == &huart6) {
        pi_link_on_tx_complete(huart);
    }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
    if (huart == &huart2) {
        ++g_uart2_rx_cnt;
        ddsm_bus_on_rx_byte(&g_ddsm_bus, HAL_GetTick());
    } else if (huart == &huart3) {
        /* One completed servo-ring lap: the truth source for the producer
         * reconstruction in the main-loop drain (see dma_rx_ring.h). */
        dma_rx_ring_note_lap(&g_st3215_ring);
    } else if (huart == &huart6) {
        pi_transport_note_lap(&g_pi_transport);
    }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {
    if (huart == &huart2) {
        ++g_uart2_err_cnt;
        ddsm_bus_on_uart_error(&g_ddsm_bus, huart);
    } else if (huart == &huart3) {
        ++g_uart3_err_cnt;
        st3215_bus_on_uart_error(&g_st3215_bus);
        if ((huart->ErrorCode & (HAL_UART_ERROR_ORE | HAL_UART_ERROR_NE |
                                 HAL_UART_ERROR_FE)) != 0U) {
            g_uart3_rx_rearm = 1U;
        }
    } else if (huart == &huart6) {
        ++g_uart6_err_cnt;
        /* RX-side errors (overrun/noise/framing) must not drop queued TX
         * telemetry: circular DMA reception keeps running and the streaming
         * decoder resynchronizes on its own.  Only genuine TX failures fall
         * through to the TX queue recovery.  Overrun still makes the HAL
         * abort the RX DMA, so schedule a re-arm. */
        if ((huart->ErrorCode & (HAL_UART_ERROR_ORE | HAL_UART_ERROR_NE |
                                 HAL_UART_ERROR_FE)) == 0U) {
            pi_link_on_tx_error(huart);
        } else {
            g_uart6_rx_rearm = 1U;
        }
    }
}

/**
 * @brief DMA2 Stream1 (USART6 RX) global interrupt handler.
 */
void DMA2_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&hdma_usart6_rx);
}

/**
 * @brief DMA1 Stream1 (USART3 RX) global interrupt handler.
 */
void DMA1_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&hdma_usart3_rx);
}

/**
 * @brief EXTI1 (PB1 Pin) global interrupt handler.
 */
void EXTI1_IRQHandler(void) {
    HAL_GPIO_EXTI_IRQHandler(IMU_INT_PIN);
}

/**
 * @brief Fatal error handler: stop actuators intent, lock down and slow-blink LED2.
 */
void Error_Handler(void) {
    __disable_irq();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = GPIO_PIN_13; /* LED2 (PC13, active low) */
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    while (1) {
        HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
        for (volatile uint32_t i = 0; i < 4000000; i++) {
            __NOP();
        }
    }
}
